# YOLOv3 🚀 by Ultralytics, GPL-3.0 license

# Parameters
ch: 1
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
#  - [46,113, 54,166, 87,179]  # P3/8
#  - [95,192, 115,219, 168,239]  # P4/16
  - [38,84, 46,122, 73,176]  # P3/8
  - [96,219, 104,220, 137,226]  # P4/16

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 1, 1]],  # 0
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 1-P1/2ll

   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 3-P2/4
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 5-P3/8
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 7-P4/16
#   [-1, 1, Conv, [256, 3, 1]],
#   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 9-P5/32
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, nn.ZeroPad2d, [[0, 1, 0, 1]]],  # 9
   [-1, 1, nn.MaxPool2d, [2, 1, 0]],  # 10
  ]

# YOLOv3-tiny head
head:
  [[-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],  # 13 (P4/16-large)

   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [256, 3, 1]],  # 17 (P3/8-medium)

   [[17, 13], 1, Detect, [nc, anchors]],  # Detect(P4, P3)
  ]
